# Summarische Statistik

In [1]:
## Modul importieren
import numpy as np
import pandas as pd

In [2]:
homelessness = pd.read_csv("homelessness.csv", index_col="Unnamed: 0")
homelessness

,region,state,individuals,family_members,state_pop
0,East South Central,Alabama,2570.0,864.0,4887681
1,Pacific,Alaska,1434.0,582.0,735139
2,Mountain,Arizona,7259.0,2606.0,7158024
3,West South Central,Arkansas,2280.0,432.0,3009733
4,Pacific,California,109008.0,20964.0,39461588
5,Mountain,Colorado,7607.0,3250.0,5691287
6,New England,Connecticut,2280.0,1696.0,3571520
7,South Atlantic,Delaware,708.0,374.0,965479
8,South Atlantic,District of Columbia,3770.0,3134.0,701547
9,South Atlantic,Florida,21443.0,9587.0,21244317
10,South Atlantic,Georgia,6943.0,2556.0,10511131
11,Pacific,Hawaii,4131.0,2399.0,1420593
12,Mountain,Idaho,1297.0,715.0,1750536
13,East North Central,Illinois,6752.0,3891.0,12723071
14,East North Central,Indiana,3776.0,1482.0,6695497
15,West North Central,Iowa,1711.0,1038.0,3148618
16,West North Central,Kansas,1443.0,773.0,2911359
17,East South Central,Kentucky,2735.0,953.0,4461153
18,West South Central,Louisiana,2540.0,519.0,4659690
19,New England,Maine,1450.0,1066.0,1339057
20,South Atlantic,Maryland,4914.0,2230.0,6035802
21,New England,Massachusetts,6811.0,13257.0,6882635
22,East North Central,Michigan,5209.0,3142.0,9984072
23,West North Central,Minnesota,3993.0,3250.0,5606249
24,East South Central,Mississippi,1024.0,328.0,2981020
25,West North Central,Missouri,3776.0,2107.0,6121623
26,Mountain,Montana,983.0,422.0,1060665
27,West North Central,Nebraska,1745.0,676.0,1925614
28,Mountain,Nevada,7058.0,486.0,3027341
29,New England,New Hampshire,835.0,615.0,1353465
30,Mid-Atlantic,New Jersey,6048.0,3350.0,8886025
31,Mountain,New Mexico,1949.0,602.0,2092741
32,Mid-Atlantic,New York,39827.0,52070.0,19530351
33,South Atlantic,North Carolina,6451.0,2817.0,10381615
34,West North Central,North Dakota,467.0,75.0,758080
35,East North Central,Ohio,6929.0,3320.0,11676341
36,West South Central,Oklahoma,2823.0,1048.0,3940235
37,Pacific,Oregon,11139.0,3337.0,4181886
38,Mid-Atlantic,Pennsylvania,8163.0,5349.0,12800922
39,New England,Rhode Island,747.0,354.0,1058287
40,South Atlantic,South Carolina,3082.0,851.0,5084156
41,West North Central,South Dakota,836.0,323.0,878698
42,East South Central,Tennessee,6139.0,1744.0,6771631
43,West South Central,Texas,19199.0,6111.0,28628666
44,Mountain,Utah,1904.0,972.0,3153550
45,New England,Vermont,780.0,511.0,624358
46,South Atlantic,Virginia,3928.0,2047.0,8501286
47,Pacific,Washington,16424.0,5880.0,7523869
48,South Atlantic,West Virginia,1021.0,222.0,1804291
49,East North Central,Wisconsin,2740.0,2167.0,5807406
50,Mountain,Wyoming,434.0,205.0,577601

In [3]:
homele_indi_mean = homelessness["individuals"].mean()
print("Mittelwert", homele_indi_mean)

Mittelwert 7225.78431372549

In [4]:
# Mittelwert ausgeben
homele_indi_mean = homelessness["individuals"].mean()
print("Mittelwert", homele_indi_mean)

# Median ausgeben
homele_indi_median = homelessness["individuals"].median()
print("Median", homele_indi_median)

# Minimum ausgeben
homele_indi_min = homelessness["individuals"].min()
print("Minimum", homele_indi_min)

# Maximum ausgeben
homele_indi_max = homelessness["individuals"].max()
print("Maximum", homele_indi_max)

# Modus ausgeben
homele_indi_modus = homelessness["individuals"].mode()
print("Modus", homele_indi_modus)

# Standardabweichung
homele_indi_std = homelessness["individuals"].std()
print("Standardawbeichung", homele_indi_std)

# Varianz
homele_indi_var = homelessness["individuals"].var()
print("Varianz", homele_indi_var)

homele_indi_sum = homelessness["individuals"].sum()
print("Summe", homele_indi_sum)

homele_indi_quantile = homelessness["individuals"].quantile(0.6)
print("Quantile", homele_indi_quantile)

Mittelwert 7225.78431372549
Median 3082.0
Minimum 434.0
Maximum 109008.0
Modus 0    2280.0
1    3776.0
Name: individuals, dtype: float64
Standardawbeichung 15991.025083231812
Varianz 255712883.21254897
Summe 368515.0
Quantile 3993.0

In [5]:
def pct30(spalte):
    return spalte.quantile(0.3)

def pct40(spalte):
    return spalte.quantile(0.4)

def IQR(spalte):
    return spalte.quantile(0.75) - spalte.quantile(0.25)

# Aggregier Methode

In [6]:
homelessness["state_pop"].agg(pct30)

2092741.0

In [7]:
homelessness[["individuals", "state_pop"]].agg(pct30)

individuals       1745.0
state_pop      2092741.0
dtype: float64

In [8]:
homelessness["state_pop"].agg([pct30, pct40])

pct30    2092741.0
pct40    3148618.0
Name: state_pop, dtype: float64

In [9]:
homelessness["state_pop"].agg(IQR)

5563533.0

# Werte kummulieren

In [10]:
homelessness["state_pop"].cumsum().head(3)
# Kumuliert die Spalte auf mittels +

0     4887681
1     5622820
2    12780844
Name: state_pop, dtype: int64

In [11]:
homelessness["individuals"].cumprod().head(4)
# Multipliziert die Spalte mittels *

0    2.570000e+03
1    3.685380e+06
2    2.675217e+10
3    6.099496e+13
Name: individuals, dtype: float64

In [12]:
homelessness["individuals"].cummax().head(5)

0      2570.0
1      2570.0
2      7259.0
3      7259.0
4    109008.0
Name: individuals, dtype: float64

In [13]:
homelessness["individuals"].cummin().head(5)

0    2570.0
1    1434.0
2    1434.0
3    1434.0
4    1434.0
Name: individuals, dtype: float64

# Sales Daten importieren

In [14]:
sales_data = pd.read_csv("sales_subset.csv", index_col="Unnamed: 0")
sales_data.head()

,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
1,1,A,1,2010-03-05,21827.90,False,8.055556,0.693452,8.106
2,1,A,1,2010-04-02,57258.43,False,16.816667,0.718284,7.808
3,1,A,1,2010-05-07,17413.94,False,22.527778,0.748928,7.808
4,1,A,1,2010-06-04,17558.09,False,27.050000,0.714586,7.808

In [15]:
sales_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10774 entries, 0 to 10773
Data columns (total 9 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   store                 10774 non-null  int64
 1   type                  10774 non-null  object
 2   department            10774 non-null  int64
 3   date                  10774 non-null  object
 4   weekly_sales          10774 non-null  float64
 5   is_holiday            10774 non-null  bool
 6   temperature_c         10774 non-null  float64
 7   fuel_price_usd_per_l  10774 non-null  float64
 8   unemployment          10774 non-null  float64
dtypes: bool(1), float64(4), int64(2), object(2)
memory usage: 768.1+ KB

# Aggregation

In [16]:
def iqr(spalte):
    return spalte.quantile(0.75) - spalte.quantile(0.25)

In [17]:
sales_data["temperature_c"].agg(iqr)

16.583333333333336

In [18]:
sales_data[["temperature_c", "fuel_price_usd_per_l", "unemployment"]].agg(iqr)

temperature_c           16.583333
fuel_price_usd_per_l     0.073176
unemployment             0.565000
dtype: float64

In [19]:
import numpy as np
sales_data[["temperature_c", "fuel_price_usd_per_l", "unemployment"]].agg([iqr, np.median])

        temperature_c  fuel_price_usd_per_l  unemployment
iqr         16.583333              0.073176         0.565
median      16.966667              0.743381         8.099

# Statistik

In [20]:
sales_1_1 = sales_data.sort_values("date")
sales_1_1

,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
6437,19,A,13,2010-02-05,38597.52,False,-6.133333,0.780365,8.350
1249,2,A,31,2010-02-05,3840.21,False,4.550000,0.679451,8.324
6449,19,A,14,2010-02-05,17590.59,False,-6.133333,0.780365,8.350
6461,19,A,16,2010-02-05,4929.87,False,-6.133333,0.780365,8.350
...,...,...,...,...,...,...,...,...,...
3592,6,A,99,2012-10-05,440.00,False,21.577778,0.955511,5.329
8108,20,A,99,2012-10-05,660.00,False,15.983333,1.052726,7.293
10773,39,A,99,2012-10-05,915.00,False,22.250000,0.955511,6.228
6257,14,A,96,2012-10-12,3.00,False,12.483333,1.056689,8.667
3384,6,A,77,2012-10-26,-21.63,False,22.411111,0.926188,5.329

In [21]:
sales_1_1["cum_weekly_sales"] = sales_1_1["weekly_sales"].cumsum()
sales_1_1

,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment,cum_weekly_sales
0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106,2.492450e+04
6437,19,A,13,2010-02-05,38597.52,False,-6.133333,0.780365,8.350,6.352202e+04
1249,2,A,31,2010-02-05,3840.21,False,4.550000,0.679451,8.324,6.736223e+04
6449,19,A,14,2010-02-05,17590.59,False,-6.133333,0.780365,8.350,8.495282e+04
6461,19,A,16,2010-02-05,4929.87,False,-6.133333,0.780365,8.350,8.988269e+04
...,...,...,...,...,...,...,...,...,...,...
3592,6,A,99,2012-10-05,440.00,False,21.577778,0.955511,5.329,2.568932e+08
8108,20,A,99,2012-10-05,660.00,False,15.983333,1.052726,7.293,2.568938e+08
10773,39,A,99,2012-10-05,915.00,False,22.250000,0.955511,6.228,2.568947e+08
6257,14,A,96,2012-10-12,3.00,False,12.483333,1.056689,8.667,2.568947e+08
3384,6,A,77,2012-10-26,-21.63,False,22.411111,0.926188,5.329,2.568947e+08

In [22]:
sales_1_1["cum_max_sales"] = sales_1_1["weekly_sales"].cummax()
sales_1_1

,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment,cum_weekly_sales,cum_max_sales
0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106,2.492450e+04,24924.50
6437,19,A,13,2010-02-05,38597.52,False,-6.133333,0.780365,8.350,6.352202e+04,38597.52
1249,2,A,31,2010-02-05,3840.21,False,4.550000,0.679451,8.324,6.736223e+04,38597.52
6449,19,A,14,2010-02-05,17590.59,False,-6.133333,0.780365,8.350,8.495282e+04,38597.52
6461,19,A,16,2010-02-05,4929.87,False,-6.133333,0.780365,8.350,8.988269e+04,38597.52
...,...,...,...,...,...,...,...,...,...,...,...
3592,6,A,99,2012-10-05,440.00,False,21.577778,0.955511,5.329,2.568932e+08,293966.05
8108,20,A,99,2012-10-05,660.00,False,15.983333,1.052726,7.293,2.568938e+08,293966.05
10773,39,A,99,2012-10-05,915.00,False,22.250000,0.955511,6.228,2.568947e+08,293966.05
6257,14,A,96,2012-10-12,3.00,False,12.483333,1.056689,8.667,2.568947e+08,293966.05
3384,6,A,77,2012-10-26,-21.63,False,22.411111,0.926188,5.329,2.568947e+08,293966.05

In [23]:
sal_week_mean = sales_data["weekly_sales"].mean()
sal_week_median = sales_data["weekly_sales"].median()
print(sal_week_mean, sal_week_median)

23843.95014850566 12049.064999999999

In [24]:
sal_max_date = sales_data["date"].max()
sal_min_date = sales_data["date"].min()
print(sal_max_date, sal_min_date)

2012-10-26 2010-02-05

# Counting Methode

### Duplikate entfernen

In [25]:
sales_data.head()

,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
1,1,A,1,2010-03-05,21827.90,False,8.055556,0.693452,8.106
2,1,A,1,2010-04-02,57258.43,False,16.816667,0.718284,7.808
3,1,A,1,2010-05-07,17413.94,False,22.527778,0.748928,7.808
4,1,A,1,2010-06-04,17558.09,False,27.050000,0.714586,7.808

In [29]:
sales_data.drop(["store","department"], axis=1)

,type,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,A,2010-02-05,24924.50,False,5.727778,0.679451,8.106
1,A,2010-03-05,21827.90,False,8.055556,0.693452,8.106
2,A,2010-04-02,57258.43,False,16.816667,0.718284,7.808
3,A,2010-05-07,17413.94,False,22.527778,0.748928,7.808
4,A,2010-06-04,17558.09,False,27.050000,0.714586,7.808
...,...,...,...,...,...,...,...
10769,A,2011-12-09,895.00,False,9.644444,0.834256,7.716
10770,A,2012-02-03,350.00,False,15.938889,0.887619,7.244
10771,A,2012-06-08,450.00,False,27.288889,0.911922,6.989
10772,A,2012-07-13,0.06,False,25.644444,0.860145,6.623
10773,A,2012-10-05,915.00,False,22.250000,0.955511,6.228

In [30]:
unique_store_dept = sales_data.drop_duplicates(subset=["store", "department"])
unique_store_dept

,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
12,1,A,2,2010-02-05,50605.27,False,5.727778,0.679451,8.106
24,1,A,3,2010-02-05,13740.12,False,5.727778,0.679451,8.106
36,1,A,4,2010-02-05,39954.04,False,5.727778,0.679451,8.106
48,1,A,5,2010-02-05,32229.38,False,5.727778,0.679451,8.106
...,...,...,...,...,...,...,...,...,...
10715,39,A,95,2010-02-05,88385.24,False,6.833333,0.679451,8.554
10727,39,A,96,2010-02-05,21450.05,False,6.833333,0.679451,8.554
10739,39,A,97,2010-02-05,21162.05,False,6.833333,0.679451,8.554
10751,39,A,98,2010-02-05,9023.09,False,6.833333,0.679451,8.554
10763,39,A,99,2010-03-05,0.01,False,10.516667,0.693452,8.554

In [31]:
unique_type = sales_data.drop_duplicates(subset="type")
unique_type

,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
3593,10,B,1,2010-02-05,40212.84,False,12.411111,0.782478,9.765

In [32]:
unique_type_and_department = sales_data.drop_duplicates(subset=["type","department"])
unique_type_and_department.head(2)
unique_type_and_department.tail(4)

,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
4471,10,B,97,2010-02-05,6242.07,False,12.411111,0.782478,9.765
4483,10,B,98,2010-02-05,74.00,False,12.411111,0.782478,9.765
4975,13,A,43,2011-12-02,1.07,False,1.077778,0.895280,6.392
5041,13,A,50,2010-02-05,2945.00,False,-0.261111,0.704283,8.316

In [33]:
unique_type_and_department["type"].value_counts()
# Wie oft nach typ gezaehlt wurde.

A    80
B    77
Name: type, dtype: int64

In [ ]:
unique_type_and_department["type"].value_counts(sort=True)
# Sortierung mit Ascending

In [ ]:
unique_type_and_department["type"].value_counts(normalize=True)
# Proportional (In Relativen Anteilen)
# 50.9 % sind Typ A.

In [ ]:
holiday_dates = sales_data[sales_data["is_holiday"]].drop_duplicates("date")
holiday_dates

In [ ]:
sales_data["date"]

# Grouping

In [34]:
sales = pd.read_csv("sales_subset.csv", index_col="Unnamed: 0")
sales.head()

,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
1,1,A,1,2010-03-05,21827.90,False,8.055556,0.693452,8.106
2,1,A,1,2010-04-02,57258.43,False,16.816667,0.718284,7.808
3,1,A,1,2010-05-07,17413.94,False,22.527778,0.748928,7.808
4,1,A,1,2010-06-04,17558.09,False,27.050000,0.714586,7.808

In [35]:
# Calc total weekly sales
sales_all = sales["weekly_sales"].sum()
sales_all

256894718.89999998

In [36]:
# Subset for type A stores, calc total weekly sales
sales_A = sales[sales["type"] == "A"]["weekly_sales"].sum()
sales_A

233716315.01

In [37]:
# Subset for type B stores, calc total weekly sales
sales_B = sales[sales["type"]== "B"]["weekly_sales"].sum()
sales_B

23178403.89

In [38]:
# Subset for type C stores, calc total weekly sales
sales_C = sales[sales["type"]== "C"]["weekly_sales"].sum()
sales_C

0.0

In [39]:
# Get proportion for each type
sales_propn_by_type = [sales_A, sales_B, sales_C] / sales_all
print(sales_propn_by_type)

[0.9097747 0.0902253 0.       ]

In [40]:
# Group by type; calc total weekly sales
sales_by_type = sales.groupby("type")["weekly_sales"].sum()
sales_by_type

type
A    2.337163e+08
B    2.317840e+07
Name: weekly_sales, dtype: float64

In [41]:
# Get proportion for each type
sales_propn_by_type = sales_by_type / sum(sales_by_type)
print(sales_propn_by_type)

type
A    0.909775
B    0.090225
Name: weekly_sales, dtype: float64

In [42]:
# Group by type and is_holiday; calc total weekly sales
sales_by_type_is_holiday = sales.groupby(["type","is_holiday"])["weekly_sales"].sum()
print(sales_by_type_is_holiday)

type  is_holiday
A     False         2.336927e+08
      True          2.360181e+04
B     False         2.317678e+07
      True          1.621410e+03
Name: weekly_sales, dtype: float64

In [43]:
# Group by type and is_holiday; calc total weekly sales
sales_by_type_is_holiday2 = sales.groupby(["type","is_holiday"])[["weekly_sales","fuel_price_usd_per_l"]].sum()
print(sales_by_type_is_holiday2)

                 weekly_sales  fuel_price_usd_per_l
type is_holiday
A    False       2.336927e+08           7318.270676
     True        2.360181e+04             32.606772
B    False       2.317678e+07            725.108773
     True        1.621410e+03              1.775501

In [44]:
# Import numpy with the alias np
import numpy as np

# For each store type, aggregate weekly_sales: get min, max, mean, and median
sales_stats = sales.groupby("type")["weekly_sales"].agg([np.min, np.max, np.mean, np.median])
sales_stats

        amin       amax          mean    median
type
A    -1098.0  293966.05  23674.667242  11943.92
B     -798.0  232558.51  25696.678370  13336.08

In [45]:
# For each store type, aggregate unemployment and fuel_price_usd_per_l: get min, max, mean, and median
unemp_fuel_stats = sales.groupby("type")[["unemployment","fuel_price_usd_per_l"]].agg([min, max, np.mean, np.median])
unemp_fuel_stats

     unemployment                         fuel_price_usd_per_l            \
              min    max      mean median                  min       max
type
A           3.879  8.992  7.972611  8.067             0.664129  1.107410
B           7.170  9.765  9.279323  9.199             0.760023  1.107674


          mean    median
type
A     0.744619  0.735455
B     0.805858  0.803348

# Pivot Table

### Pivot Table ist eine Alternative zu Group By
### df.pivot_table(values = "werte", index = "spalte", columns = "Spalten", aggfunc([np.mean, np.median), fill_value = 0, margins = True)

In [46]:
# Mit der groupby Methode:
mean_sales_by_type_gr = sales.groupby("type")["weekly_sales"].agg(np.mean)
mean_sales_by_type_gr

type
A    23674.667242
B    25696.678370
Name: weekly_sales, dtype: float64

In [51]:
# Mit Pivot Table
# Pivot for mean weekly_sales for each store type
mean_sales_by_type = sales.pivot_table(values = "weekly_sales", index = "type", aggfunc=np.mean)
mean_sales_by_type

      weekly_sales
type
A     23674.667242
B     25696.678370

In [53]:
# Mit Pivot Table
# Pivot for mean weekly_sales for each store type
mean_sales_by_type = sales.pivot_table(values = "weekly_sales", index = "type")
mean_sales_by_type

      weekly_sales
type
A     23674.667242
B     25696.678370

In [54]:
# Pivot for mean and median weekly_sales for each store type
mean_med_sales_by_type = sales.pivot_table(values = "weekly_sales", index = "type", aggfunc=([np.mean, np.median]))
mean_med_sales_by_type

              mean       median
      weekly_sales weekly_sales
type
A     23674.667242     11943.92
B     25696.678370     13336.08

In [55]:
# Pivot for mean weekly_sales by store type and holiday 
mean_sales_by_type_holiday = sales.pivot_table(values = "weekly_sales", columns = "is_holiday", index = "type")
mean_sales_by_type_holiday

is_holiday         False       True
type
A           23768.583523  590.04525
B           25751.980533  810.70500

In [56]:
# Print mean weekly_sales by department and type; fill missing values with 0
print(sales.pivot_table(values = "weekly_sales", index = "department", columns = "type", fill_value = 0))

type                    A              B
department
1            30961.725379   44050.626667
2            67600.158788  112958.526667
3            17160.002955   30580.655000
4            44285.399091   51219.654167
5            34821.011364   63236.875000
...                   ...            ...
95          123933.787121   77082.102500
96           21367.042857    9528.538333
97           28471.266970    5828.873333
98           12875.423182     217.428333
99             379.123659       0.000000

[80 rows x 2 columns]

In [57]:
# Print the mean weekly_sales by department and type; fill missing values with 0s; sum all rows and cols
print(sales.pivot_table(values="weekly_sales", index="department", columns="type", fill_value = 0, margins=True))

type                   A              B           All
department
1           30961.725379   44050.626667  32052.467153
2           67600.158788  112958.526667  71380.022778
3           17160.002955   30580.655000  18278.390625
4           44285.399091   51219.654167  44863.253681
5           34821.011364   63236.875000  37189.000000
...                  ...            ...           ...
96          21367.042857    9528.538333  20337.607681
97          28471.266970    5828.873333  26584.400833
98          12875.423182     217.428333  11820.590278
99            379.123659       0.000000    379.123659
All         23674.667242   25696.678370  23843.950149

[81 rows x 3 columns]